In [1]:
'''1. Filtering and Displaying Data
a) Find all rows where the City is either "Chicago" or "San Fransico", and display only the Name and Marks.

b) Display the rows where Gender is "Male", and Marks are between 75 and 90 (inclusive).

2. Adding and Modifying Columns
a) Create a new column called Bonus where each student gets a bonus of 5 marks if their current Marks is less than 85. For others, add 2 marks.

b) Modify the Age column by increasing every value by 1 year (to simulate a year passed).

3. Using groupby
a) Find the average Marks for each City.
b) Find the total number of students for each Gender.

4. Complex Filtering
a) Find all rows where:

The City is either "Los Angeles" or "Chicago",
The Marks are greater than 80,
The Age is less than 22.
5. Sorting
a) Sort the entire DataFrame by Marks in descending order.
b) Sort by City and then by Marks (both in ascending order).

Bonus Question
Simulate a new DataFrame vr_copy where the Marks values for students from "Chicago" are increased by 10%.
Hint: Use .copy() to avoid modifying the original DataFrame. '''

'1. Filtering and Displaying Data\na) Find all rows where the City is either "Chicago" or "San Fransico", and display only the Name and Marks.\n\nb) Display the rows where Gender is "Male", and Marks are between 75 and 90 (inclusive).\n\n2. Adding and Modifying Columns\na) Create a new column called Bonus where each student gets a bonus of 5 marks if their current Marks is less than 85. For others, add 2 marks.\n\nb) Modify the Age column by increasing every value by 1 year (to simulate a year passed).\n\n3. Using groupby\na) Find the average Marks for each City.\nb) Find the total number of students for each Gender.\n\n4. Complex Filtering\na) Find all rows where:\n\nThe City is either "Los Angeles" or "Chicago",\nThe Marks are greater than 80,\nThe Age is less than 22.\n5. Sorting\na) Sort the entire DataFrame by Marks in descending order.\nb) Sort by City and then by Marks (both in ascending order).\n\nBonus Question\nSimulate a new DataFrame vr_copy where the Marks values for students from "Chicago" are increased by 10%.\nHint: Use .copy() to avoid modifying the original DataFrame. '

In [1]:
import pandas as pd

In [2]:
d1={"Name":["John","Alice","Bob","Emma"],
"Age":[20,22,12,21],
"Gender":["Male","Female","Male","Female"],
"Marks":[88,92,75,89],
"City":["New York","Los Angeles","Chicago","San Fransico"]}
vr=pd.DataFrame(d1)

In [3]:
vr.loc[(vr["City"]=="Chicago")|(vr["City"]=="San Fransico")][["Name","Marks"]]

   Name  Marks
2   Bob     75
3  Emma     89

In [4]:
vr.loc[vr["Gender"] == "Male"]
#The second condition is redundant because all numbers are either greater than 75 or less than 90.

   Name  Age Gender  Marks      City
0  John   20   Male     88  New York
2   Bob   12   Male     75   Chicago

In [5]:
def bonus(Marks):
    if Marks<85:
        return Marks+5
    else:
        return Marks+2
vr["Bonus"]=vr["Marks"].apply(bonus)
vr

    Name  Age  Gender  Marks          City  Bonus
0   John   20    Male     88      New York     90
1  Alice   22  Female     92   Los Angeles     94
2    Bob   12    Male     75       Chicago     80
3   Emma   21  Female     89  San Fransico     91

In [23]:
vr["Age"] = [20, 22, 12, 21]  # Reset to original Age values
vr["Age"] = vr["Age"] + 1
vr

    Name  Age  Gender  Marks          City  Bonus
0   John   21    Male     88      New York     90
1  Alice   23  Female     92   Los Angeles     94
2    Bob   13    Male     75       Chicago     80
3   Emma   22  Female     89  San Fransico     91

In [19]:
vr.groupby("City")["Marks"].mean()

City
Chicago         75.0
Los Angeles     92.0
New York        88.0
San Fransico    89.0
Name: Marks, dtype: float64

In [6]:
vr["Gender"].value_counts()

Gender
Male      2
Female    2
Name: count, dtype: int64

In [9]:
vr.loc[(((vr["City"]=="Los Angeles")|(vr["City"]=="Chicago"))&(vr["Marks"]>80)&(vr["Age"]<22))]

Empty DataFrame
Columns: [Name, Age, Gender, Marks, City, Bonus]
Index: []

In [10]:
vr.sort_values(by="Marks",ascending=False)

    Name  Age  Gender  Marks          City  Bonus
1  Alice   22  Female     92   Los Angeles     94
3   Emma   21  Female     89  San Fransico     91
0   John   20    Male     88      New York     90
2    Bob   12    Male     75       Chicago     80

In [20]:
vr.sort_values(by=["City","Marks"],ascending=True)

    Name  Age  Gender  Marks          City  Bonus
2    Bob   14    Male     75       Chicago     80
1  Alice   24  Female     92   Los Angeles     94
0   John   22    Male     88      New York     90
3   Emma   23  Female     89  San Fransico     91

In [25]:
vr_copy=vr.copy()# Create a copy of the original DataFrame
vr_copy.loc[vr_copy["City"]=="Chicago","Marks"]*=1.10 # Increase the Marks by 10% for students in "Chicago"
vr_copy

C:\Users\Jashwanth\AppData\Local\Temp\ipykernel_24364\750708283.py:2: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value '[82.5]' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  vr_copy.loc[vr_copy["City"]=="Chicago","Marks"]*=1.10 # Increase the Marks by 10% for students in "Chicago"

    Name  Age  Gender  Marks          City  Bonus
0   John   21    Male   88.0      New York     90
1  Alice   23  Female   92.0   Los Angeles     94
2    Bob   13    Male   82.5       Chicago     80
3   Emma   22  Female   89.0  San Fransico     91